import sqlite3

con = sqlite3.connect('exams.db')
cursor = con.cursor()
cursor.execute('''
    CREATE TABLE math (
        name TEXT,
        lastname TEXT,
        group_name TEXT,
        grade INTEGER
    );
''')

# Добавляем данные о студентах
students = [
    ('Анна', 'Самохина', 'c23', 4),
    ('Дмитрий', 'Филиппов', 'b23', 5),
    ('Константин', 'Иванов', 'b23', 4),
    ('Мария', 'Петрова', 'b23', 4),
    ('Александра', 'Сергеева', 'b23', 5),
    ('Денис', 'Тихонов', 'b23', 4),
    ('Александр', 'Никитин', 'a23', 4),
    ('Артем', 'Андреев', 'b23', 5),
    ('Леонид', 'Лебедев', 'b23', 4),
    ('Никита', 'Яковлев', 'b23', 4),
    ('Наталья', 'Кузнецова', 'b23', 5),
    ('Ирина', 'Гусева', 'a23', 3),
    ('Владимир', 'Макаров', 'b23', 4),
    ('Евгений', 'Зайцев', 'b23', 5),
    ('Оксана', 'Соколова', 'b23', 3),
    ('Светлана', 'Захарова', 'b23', 4),
    ('Дарья', 'Дмитриева', 'b23', 5),
    ('Максим', 'Куликов', 'b23', 3),
    ('Алексей', 'Игнатов', 'a23', 4),
    ('Антон', 'Григорьев', 'b23', 3),
    ('Анастасия', 'Кузьмина', 'b23', 5),
    ('Татьяна', 'Максимова', 'b23', 5),
    ('Егор', 'Максимов', 'b23', 5),
    ('Анастасия', 'Красильникова', 'b23', 4),
    ('Даниил', 'Юдин', 'b23', 4),
    ('Виктория', 'Алексеева', 'b23', 5),
    ('Анжелика', 'Егорова', 'b23', 3),
    ('Полина', 'Анисимова', 'c23', 4),
    ('Екатерина', 'Киселева', 'b23', 5),
]

cursor.executemany('''
    INSERT INTO math (name, lastname, group_name, grade)
    VALUES (?, ?, ?, ?)
''', students)

con.commit()
con.close()