import sqlite3

# Подключение к базе данных
conn = sqlite3.connect('pharmacy.db')
cursor = conn.cursor()

# Создание таблицы medicines
cursor.execute('''CREATE TABLE medicines
                (name text, manufacturer text, form text, price real)''')

# Заполнение таблицы данными о лекарствах
medicines = [('амоксициллин', 'BPharma', 'капсулы', 265),
             ('амоксициллин', 'Healthy', 'сироп', 250),
             ('амоксициллин', 'Pharmstandart', 'таблетки', 150),
             ('амоксициллин', 'Teva', 'ампулы', 350),
             ('аспирин', 'Bayer', 'таблетки', 100),
             ('аспирин', 'Stada', 'капсулы', 120),
             ('аспирин', 'Teva', 'сироп', 190),
             ('валидол', 'Pharmstandart', 'таблетки', 50),
             ('валидол', 'Stada', 'капсулы', 60),
             ('валидол', 'Healthy', 'сироп', 70),
             ('валериана', 'BPharma', 'капсулы', 80),
             ('валериана', 'Pharmstandart', 'таблетки', 90),
             ('валериана', 'Healthy', 'сироп', 100),
             ('глицин', 'Pharmstandart', 'таблетки', 40),
             ('глицин', 'BPharma', 'капли', 30),
             ('диазолин', 'Healthy', 'таблетки', 120),
             ('диазолин', 'Pharmstandart', 'капсулы', 130),
             ('диазолин', 'Stada', 'сироп', 140),
             ('димедрол', 'BPharma', 'таблетки', 50),
             ('димедрол', 'Healthy', 'капсулы', 60),
             ('димедрол', 'Pharmstandart', 'сироп', 70),
             ('димедрол', 'Teva', 'ампулы', 170),
             ('ибупрофен', 'Bayer', 'таблетки', 80),
             ('ибупрофен', 'Healthy', 'капсулы', 90),
             ('ибупрофен', 'Pharmstandart', 'сироп', 100),
             ('кетонал', 'Teva', 'таблетки', 200),
             ('кетонал', 'Stada', 'капсулы', 210),
             ('кетонал', 'BPharma', 'сироп', 220),
             ('мезим', 'Pharmstandart', 'таблетки', 150),
             ('мезим', 'Healthy', 'капсулы', 160),
             ('мезим', 'BPharma', 'сироп', 170),
             ('нурофен', 'Bayer', 'таблетки', 120),
             ('нурофен', 'Healthy', 'капсулы', 130),
             ('нурофен', 'Pharmstandart', 'сироп', 140)]

cursor.executemany('INSERT INTO medicines VALUES (?,?,?,?)', medicines)

# Сохранение изменений и закрытие базы данных
conn.commit()
conn.close()
